Repository: UlrichViefhaus/dev-tails
Catalog: wiki/src/doc/advanced_topics/changing_gnome_settings.*.po
Languages: de

source: [[!meta title="Changing settings of the Gnome Desktop"]]
de: [[!meta title="Änder der Einstellungen des Gnome Desktop"]]

source: Tails uses the [[Gnome desktop|doc/about/features]] for a comfortable user experience and its Assistive Technologies. Gnome3 uses a configuration system called dconf to store the settings of Gnome software. All settings of newer Gnome software are saved in your home directory in the hidden folder <span class="filename">~/.dconf</span>. Older ones used the deprecated gconf system.
de: Tail nutzt für ein bequeme Bedienbarkeit und wegen der Assistenzfunktionen den [[Gnome desktop|doc/about/features]]. Gnome3 nutzt das Konfigurationssystem dconf, um die Einstellungen der Gnome Software zu speichern. Alle Einstellung neuerer Gnome Software werden in dem versteckten Verzeichnis <span class="filename">~/.dconf</span> des Heimverzeichnisses gespeichert. Ältere Gnome Software nutzt dafür das veraltete System gconf.

source: <p>The default configuration of Tails tries to protect you as much as possible. If you chose settings that differ from that defaults, it could mitigate the protection attempts of Tails. Please make sure that you understand the consequences of the settings you are going to change.</p>
de: <p>Die Standardeinstellungen von Tails versuchen dich so gut wie möglich zu schützen. Falls du von diesen Standards abweichst, könnte es den Schutz von Tails unterlaufen. Versichere dich daher, ob du alle Konsequenzen einer geplanten Änderung der Einstellungen verstanden hast.</p>

source: Since Tails is amnesic, any changes to the settings have to be done at the start of every season. To keep those settings you have to use the [[<span class="guilabel">dotfiles</span> persistence feature|doc/first_steps/persistence/configure#dotfiles]].
de: Da Tails gedächtnisslos ist, müssen alle Änderungen zu Beginn einer Sitzung wiederholt werden. Um die Einstellungen dauerhaft zu speichern, muss [[<span class="guilabel">dotfiles</span> persistence feature|doc/first_steps/persistence/configure#dotfiles]] aktiviert werden.

source: ##Change a setting
de: ##Einstellungen ändern

source: <p>To change settings using <span class="application">gsettings</span>:
de: <p>Eine Einstellungen mittels <span class="application">gsettings</span> ändern:

source: 1. Open a terminal from the menu: <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Favorites</span>&nbsp;▸ <span class="guimenuitem">Terminal</span> </span> 2. Enter <span class="command">gsettings set #key #value</span> and press <span class="keycap">Enter</span>
de: 1. Öffne ein Terminalfenster: <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Favorites</span>&nbsp;▸ <span class="guimenuitem">Terminal</span> </span> 2. Gib den Befehl <span class="command">gsettings set #key #value</span> ein und drücke <span class="keycap">Enter</span>

source: Replace #key with the name of the setting you want to change and #value with the value of the setting.
de: Gib statt #key den Namen der Einstellung, die du ändern willst ein, und deren neuen Wert für #value.

source: For example: <span class="command">gsettings set org.gnome.nautilus.preferences default-sort-order type</span> changes the default sort order of the file explorer Nautilus to type.
de: Beispiel: <span class="command">gsettings set org.gnome.nautilus.preferences default-sort-order type</span> ändert die Sortierreihenfolge des Dateibrowsers Nautilus zu "type".

source: ##Get the current value of a setting
de: #Zeige den aktuellen Wert einer Einstellung an

source: <p>To get the current value of a setting with<span class="application">gsettings</span>:
de: <p>Zeige den aktuellen Wert einer Einstellung mittels <span class="application">gsettings</span>:

source: 1. Open a terminal from the menu: <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Favorites</span>&nbsp;▸ <span class="guimenuitem">Terminal</span> </span> 2. Enter <span class="command">gsettings get #key</span> and press <span class="keycap">Enter</span>
de: 1. Öffne ein Terminalfenster: <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Favorites</span>&nbsp;▸ <span class="guimenuitem">Terminal</span> </span> 2. Gib den Befehl <span class="command">gsettings get #key</span> ein und drücke <span class="keycap">Enter</span>

source: Replace #key with the name of the setting from which you want to get the current value.
de: Gib statt #key den Namen der Einstellung an, von der du dir den aktuellen Wert anzeigen lassen möchtest.

source: For example: <span class="command">gsettings get org.gnome.nautilus.preferences default-sort-order</span> prints the current value of sort order of the file explorer Nautilus.
de: Beispiel: <span class="command">gsettings get org.gnome.nautilus.preferences default-sort-order</span> zeigt die eingestellte Sortierreihenfolge des Dateibrowsers Nautilus an.

source: ##Restore the default value of a setting
de: ##Den Standardwert einer Einstellung wiederherstellen

source: <p>To reset the value of a setting to the default value with <span class="application">gsettings</span>:
de: <p>Den Standardwert einer Einstellung mittels <span class="application">gsettings</span> wiederherstellen:

source: 1. Open a terminal from the menu: <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Favorites</span>&nbsp;▸ <span class="guimenuitem">Terminal</span> </span> 2. Enter <span class="command">gsettings reset #key</span> and press <span class="keycap">Enter</span>
de: 1. Öffne ein Terminalfenster: <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Favorites</span>&nbsp;▸ <span class="guimenuitem">Terminal</span> </span> 2. Gib den Befehl <span class="command">gsettings reset #key</span> ein und drücke <span class="keycap">Enter</span>

source: Replace #key with the name of the setting you want to reset to the default value.
de: Ersetzte #key mit dem Namen der Einstellung, deren Standardwert du wiederherstellen möchtest

source: For example: <span class="command">gsettings get org.gnome.nautilus.preferences default-sort-order</span> sets the value of the sort order of the file explorer Nautilus to the default value.
de: Beispiel: <span class="command">gsettings get org.gnome.nautilus.preferences default-sort-order</span> stellt den Standardwert der Sortierreihenfolge des Dateibrowsers Nautilus wieder her.

source: ##Get possible values of a setting
de: ##Alle möglichen Werte einer Einstellung anzeigen

source: <p>To show which values an option can be set to with <span class="application">gsettings</span>:
de: <p>Alle möglichen Werte einer Einstellung mittels <span class="application">gsettings</span> anzeigen:

source: 1. Open a terminal from the menu: <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Favorites</span>&nbsp;▸ <span class="guimenuitem">Terminal</span> </span> 2. Enter <span class="command">gsettings range #key</span> and press <span class="keycap">Enter</span>
de: 1. Öffne ein Terminalfenster: <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Favorites</span>&nbsp;▸ <span class="guimenuitem">Terminal</span> </span> 2. Gib den Befehl <span class="command">gsettings range #key</span> ein und drücke <span class="keycap">Enter</span>

source: Replace #key with the name of the setting from which you want to know the values.
de: Ersetze #key mit dem Namen der Einstellung, deren mögliche Werte du wissen möchtest.

source: For example: <span class="command">gsettings range org.gnome.nautilus.preferences default-sort-order</span> shows the possible values for the default sort order of Nautilus.
de: Beispiel: <span class="command">gsettings range org.gnome.nautilus.preferences default-sort-order</span> zeigt alle möglichen Werte für die Sortierreihenfolge des Dateibrowsers Nautilus an.

source: ##Get more infos about gsettings
de: ##Weitere Informationen über gsettings

source: <p>To get more information about <span class="application">gsettings</span>:
de: <p>Weitere Informationen über <span class="application">gsettings</span> anzeigen:

source: 1. Open a terminal from the menu: <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Favorites</span>&nbsp;▸ <span class="guimenuitem">Terminal</span> </span> 2. Enter <span class="command">man gsettings</span> and press <span class="keycap">Enter</span>
de: 1. Öffne ein Terminalfenster: <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Favorites</span>&nbsp;▸ <span class="guimenuitem">Terminal</span> </span> 2. Gib den Befehl <span class="command">man gsettings</span> ein und drücke <span class="keycap">Enter</span>
