Repository: UlrichViefhaus/dev-tails
Catalog: wiki/src/news/version_2.5.*.po
Languages: de

source: [[!meta date="Tue Aug 2 12:34:56 2016"]]
de: [[!meta date="Donnerstag 2. August 12:34:56 2016"]]

source: [[!meta title="Tails 2.5 is out"]]
de: [[!meta title="Tails 2.5 ist da"]]

source: This release fixes [[many security issues|security/Numerous_security_holes_in_2.4]] and users should upgrade as soon as possible.
de: Dieses Release schließt [[zahlreiche Sicherheitslücken|security/Numerous_security_holes_in_2.4]] und Nutzer sollten so schnell wie möglich ein Upgrade durchführen.

source: Changes
de: Änderungen

source: New features
de: Neue Funktionen

source: Upgrades and changes
de: Aktualisierungen und Änderungen

source: - Update *Tor Browser* to 6.0.3, based on *Firefox* 45.3.
de: - Aktualisierung des *Tor Browser* auf Version 6.0.3, welcher auf *Firefox* 45.3 basiert

source: - Upgrade *Icedove* to 45.1. ([[!tails_ticket 11530]])
de: - Upgrade von *Icedove* auf Version 45.1. ([[!tails_ticket 11530]])

source: Fixed problems
de: Korrekturen

source: The automatic account configuration of *Icedove* used to freeze when connecting to some email providers. ([[!tails_ticket 11486]])
de: Die automatische Accounterstellung von *Icedove* stürzte bei der Verbindung zu manchen Mailprovidern reproduzierbar ab. ([[!tails_ticket 11486]])

source: In some cases sending an email with *Icedove* used to result in the error: "The message could not be sent using Outgoing server (SMTP) mail.riseup.net for an unknown reason." ([[!tails_ticket 10933]])
de: In manchen Fällen kam es beim Senden von Mails mit *Icedove* zu folgendem Fehler: "The message could not be sent using Outgoing server (SMTP) mail.riseup.net for an unknown reason." ([[!tails_ticket 10933]])

source: A spurious error message used to sometimes appear when creating an account in *Icedove* and providing its password. ([[!tails_ticket 11550]])
de: Sporadisch trat ein Fehler beim Erstellen eines Benutzerkontos in *Icedove* auf, wenn ein Passwort angegeben wurde. ([[!tails_ticket 11550]])

source: Fix some time synchronization problems, by replacing obsolete and unreliable servers, and decreasing a timeout. ([[!tails_ticket 11577]])
de: Einige Fehler bei der Synchronisierung wurden gelöst, indem veraltete und instabile Server ersetzt und die Zeit bis zu einem Timeout vergrößert wurden. ([[!tails_ticket 11577]])

source: [[KVM virtual machines|doc/advanced_topics/virtualization/virt-manager]] with QXL video: vastly improve graphics performance and fix visual artifacts in *Tor Browser*. ([[!tails_ticket 11500]], [[!tails_ticket 11489]])
de: [[Virtuelle Maschinen mit KVM|doc/advanced_topics/virtualization/virt-manager]] mit dem QXL Videotreiber: Große Geschwindigkeitssteigerungen und Beseitigung einiger Grafikfehler im *Tor Browser*. ([[!tails_ticket 11500]], [[!tails_ticket 11489]])

source: For more details, read our [changelog](https://git-tails.immerda.ch/tails/plain/debian/changelog).
de: Details finden Sie in unserem [Changelog](https://git-tails.immerda.ch/tails/plain/debian/changelog).

source: Known issues
de: Bekannte Fehler

source: See the list of [[long-standing issues|support/known_issues]].
de: Sehen Sie auch in unserer Liste mit [[dauerhaften Probleme|support/known_issues]] nach.

source: Get Tails 2.5
de: Holen Sie sich Tails 2.5

source: - To install, follow our [[installation instructions|install]].
de: - Folgen Sie zur Installation unseren [[Installationhinweisen|install]].

source: - To upgrade, an automatic upgrade is available from 2.4 to 2.5.
de: - Um ein Upgrade durchzuführen, steht ein automatisches Upgrade von 2.4 nach 2.5 zur Verfügung.

source: If you cannot do an automatic upgrade or if you fail to start after an automatic upgrade, please try to do a [[manual upgrade|upgrade]].
de: Falls Sie kein automatisches Update durchführen können oder das System nach dem automatischen Update nicht mehr startet, versuchen Sie bitte ein [[manuelle Upgrade|upgrade]].

source: - [[Download Tails 2.5.|install/download]]
de: - [[Tails 2.5. downloaden|install/download]]

source: What's coming up?
de: Was kommt danach?

source: Tails 2.6 is [[scheduled|contribute/calendar]] for September 13.
de: Tails 2.6 ist für den 13. September [[geplant|contribute/calendar]].

source: Have a look at our [[!tails_roadmap]] to see where we are heading to.
de: Auf unserer [[!tails_roadmap]] können Sie sehen, was wir als nächstes vorhaben.

source: We need your help and there are many ways to [[contribute to Tails|contribute]] ([[donating|contribute/how/donate]] is only one of them). Come [[talk to us|about/contact#tails-dev]]!
de: Wir brauchen Ihre Hilfe und es gibt viele Möglichkeiten, [[Tails zu unterstützen|contribute]] ([[Spenden|contribute/how/donate]] ist nur eine davon). [[Sprich uns an|about/contact#tails-dev]]!
